app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE (products.nome LIKE  '%iPhone 12%')
---
  def index
    if params[:name] == nil
      @products = Product.all

INSERT INTO `products` (`name`, `description`, `price`, `created_at`, `updated_at`) VALUES ('teste', 'asfsdas', 2321.0, '2021-09-26 01:05:20', '2021-09-26 01:05:20')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save