app/controllers/stock_items_controller.rb

SELECT `stock_items`.* FROM `stock_items`
---
  def index
    @stock_items = StockItem.all

SELECT  `stock_items`.* FROM `stock_items` INNER JOIN `stores` ON `stores`.`id` = `stock_items`.`store_id` INNER JOIN `products` ON `products`.`id` = `stock_items`.`product_id` WHERE `stock_items`.`store_id` = 4 AND `stock_items`.`product_id` IS NULL ORDER BY `stock_items`.`id` ASC LIMIT 1
---
  def show
    @stock_product = StockItem.joins(:store, :product).where(:store_id => params[:store], :product_id => params[:product]).first

SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` IS NULL ORDER BY `stores`.`id` ASC LIMIT 1
---
  def new
    @store = Store.where(:id => params[:store]).first

SELECT  `stock_items`.* FROM `stock_items` WHERE `stock_items`.`store_id` IS NULL AND `stock_items`.`product_id` IS NULL ORDER BY `stock_items`.`id` ASC LIMIT 1
---
  def remove_product
    @stock_item = StockItem.where(:store_id => params[:stock_store], :product_id => params[:stock_product]).first

SELECT  `stock_items`.* FROM `stock_items` WHERE `stock_items`.`store_id` IS NULL AND `stock_items`.`product_id` IS NULL ORDER BY `stock_items`.`id` ASC LIMIT 1
---
  def show_remove
    @stock_item = StockItem.where(:store_id => params[:store], :product_id => params[:product]).first

SELECT  `stock_items`.* FROM `stock_items` WHERE `stock_items`.`product_id` = 1 AND `stock_items`.`store_id` = 1 ORDER BY `stock_items`.`id` ASC LIMIT 1
UPDATE `stock_items` SET `stock` = 9, `updated_at` = '2021-09-26 00:06:54' WHERE `stock_items`.`id` = 20
INSERT INTO `stock_items` (`store_id`, `product_id`, `stock`, `created_at`, `updated_at`) VALUES (1, 4, 7, '2021-09-25 03:10:42', '2021-09-25 03:10:42')
---
  def create
    @stock_exist = StockItem.where(:product_id => stock_item_params["product_id"], :store_id => stock_item_params["store_id"]).first
    if @stock_exist.present?
      @stock_product = stock_item_params["stock"].to_i + @stock_exist.stock.to_i
      @stock_exist.update(:stock => @stock_product)
    else
      @stock_item = StockItem.new(stock_item_params)
    end
    respond_to do |format|
      if @stock_exist.present?
        format.html { redirect_to stock_item_path(@stock_exist, :product => @stock_exist.product_id, :store => @stock_exist.store_id, :stock_item => stock_item_params["stock"].to_i), notice: "Estoque de Produto Adicionado com sucesso!" }
        format.json { render :show, status: :created, location: @stock_item }
      else
        if @stock_item.save

SELECT  `stock_items`.* FROM `stock_items` WHERE `stock_items`.`store_id` IS NULL AND `stock_items`.`product_id` IS NULL ORDER BY `stock_items`.`id` ASC LIMIT 1
UPDATE `stock_items` SET `stock` = 30, `updated_at` = '2021-09-26 12:57:21' WHERE `stock_items`.`id` = 3
---
  def update
    respond_to do |format|
      if params[:remove_product].present?
        @stock_exist = StockItem.where(:product_id => params[:remove_product][:product_id], :store_id => params[:remove_product][:store_id]).first
        @stock_exist.update(:stock => (@stock_exist.stock - params[:remove_product][:stock_remove].to_i))

DELETE FROM `stock_items` WHERE `stock_items`.`id` = 1
---
  def destroy
    @stock_item.destroy

SELECT  `stock_items`.* FROM `stock_items` WHERE `stock_items`.`id` = 1 LIMIT 1
---
    def set_stock_item
      @stock_item = StockItem.find(params[:id])