app/controllers/stores_controller.rb

  def index
    if params[:name] == nil
      @stores = Store.all
---
SELECT `stores`.* FROM `stores` WHERE (stores.name LIKE  '%Autorizada Apple Z%')

  def show_stock
    @store = Store.where(:id => params[:store]).first
    @stock_product = StockItem.joins(:store, :product).where(:store_id => params[:store])
---
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` IS NULL ORDER BY `stores`.`id` ASC LIMIT 1
SELECT `stock_items`.* FROM `stock_items` INNER JOIN `stores` ON `stores`.`id` = `stock_items`.`store_id` INNER JOIN `products` ON `products`.`id` = `stock_items`.`product_id` WHERE `stock_items`.`store_id` IS NULL

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO `stores` (`name`, `address`, `created_at`, `updated_at`) VALUES ('Loja X ', 'Rua Show numero 10', '2021-09-24 22:31:01', '2021-09-24 22:31:01')

  def update
    respond_to do |format|
      if @store.update(store_params)
---
UPDATE `stores` SET `name` = 'Autorizada Apple Y Show', `updated_at` = '2021-09-25 15:21:36' WHERE `stores`.`id` = 2

    def set_store
      @store = Store.find(params[:id])
---
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 2 LIMIT 1