app/views/stock_items/_form.html.erb

        <%= form.label :product_id, "Produto" , :class => 'control-label' %>
        <%= form.collection_select(:product_id, Product.order(:name), :id, :name, {:prompt=> 'Selecionar'}, :class=> "form-control", :id=> "product_id") %>
---
SELECT `products`.* FROM `products` ORDER BY `products`.`name` ASC